# WrongFabricSheetEndOverhang Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..WrongFabricSheetEndOverhang Property
BuiltInFailures..::..FabricFailures Class See Also
---
Wrong Start Overhang of the Fabric Sheet Type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WrongFabricSheetEndOverhang { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WrongFabricSheetEndOverhang As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WrongFabricSheetEndOverhang {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace